#  Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число. 
#  В качестве символа-разделителя используйте пробел.

numbers = [int(i) for i in input("Введите числа: ").split()]
# print(f"Максимально число {max(numbers)}")
# print(f"Минимально число {min(numbers)}")